loadtest.yml
config:
  target: "https://dev.d2f1sduhafpfhd.amplifyapp.com"
  phases:
    # this injects 10 virtual users every second for 60 seconds
    - name: constant_arrivial_rate
      duration: 60
      arrivalRate: 10

    # this ramp up virtual users from 10 to 50 in 60 seconds
    # - name: rampup_rate
    #   duration: 60
    #   arrivalRate: 10
    #   rampTo: 50

    # Fixed number of arrivals per seconds
    # this will create 120 virtual users in 1 minute
    # - name: fixed_arrivals
    #   duration: 60
    #   arrivalCount: 120


scenarios:
  - name: ujiipk
    flow:
      - get:
          url: "/"